export const buttonTexts = {
  responseToCustomer: `1. 顧客の質問への返答生成
      あなたは、[製品名]の専門家です。顧客が"[製品の特定の機能]についてもっと知りたい"と質問してきました。以下の#出力形式で回答を生成してください：
      #出力形式
      ・概要：機能の簡単な説明
      ・利点：顧客にとっての3つの主要な利点
      ・使用方法：基本的な使用方法の概説`,
  compareProducts: `2. 競合製品との比較
    あなたは市場調査の専門家です。[自社製品]と[競合製品]を比較し、以下のフォーマットで情報を提供してください：
    #出力形式
    ・共通点：両製品の主な共通点
    ・差別化要因：[自社製品]の独自の強みと利点
    ・対象顧客：[自社製品]が最も適している顧客層`,
  presentationSummary: `3. プレゼンテーション概要の作成
    あなたは営業部門のマネージャーです。次の顧客ミーティングで[製品/サービス名]を紹介するためのプレゼンテーション概要を作成してください。概要には以下を含めてください：
    #出力形式
    ・導入：製品/サービスの短い紹介
    ・主要機能：3つの主要機能とそれぞれの顧客へのメリット
    ・成功事例：製品/サービスを使って成功を収めた一つの顧客事例
    ・結論：製品/サービスが顧客の問題をどのように解決するかのまとめ`,
  updateFAQ: `4. FAQセクションの更新
    あなたはカスタマーサポートチームのリーダーです。[製品/サービス名]に関する最新のFAQセクションを更新するため、以下のガイドラインに沿って新しいFAQを作成してください：
    #出力形式
    ・質問：顧客からよく寄せられる新しい質問
    ・回答：それぞれの質問に対する簡潔かつ具体的な回答
    ・関連リンク：詳細情報へのリンク（該当する場合）`,
  salesStrategy: `5. 販売戦略の提案
    あなたは営業戦略のコンサルタントです。[製品/サービス名]の次四半期の販売目標を達成するための戦略を提案してください。提案には以下を含めてください：
    #出力形式
    ・目標市場：焦点を当てるべき主要な市場セグメント
    ・推進戦略：市場セグメントをターゲットにするための具体的な戦略
    ・期待成果：この戦略によって期待される具体的な成果
    ・評価指標：戦略の成功を測定するためのキーパフォーマンスインディケータ（KPI）
    `,
  firstUserComment:`＃今日したこと
中小企業の部長と二回目の商談を行いました。前回のフィードバックをもとに、弊社のソリューションが彼らの要件にどのようにフィットするかについて詳細に説明しました。また、彼らが直面している問題点に対する具体的な解決策と、それによる期待される成果について話を進めました。

＃良かったこと
部長は提案されたソリューションに興味を持ってくれて、具体的な質問をしてくれました。これにより、ニーズに合ったカスタマイズの可能性を探ることができました。また、製品のデモを見てもらう機会を得られたことも大きな進展です。

＃課題
部長からの質問の一部に即座に答えられなかったことが課題です。また、競合他社の製品に対する知識が不足していたため、比較検討の際に十分な情報を提供できませんでした。
 
＃次回の目標
次回は、より詳細な競合分析を行い、私たちのソリューションがなぜ優れているのかを明確に伝えられるように準備します。さらに、質問に即座に答えられるよう、製品知識を深めるための勉強を続けます。部長との次のアポイントメントでは、クロージングに向けた確実なステップを踏むことを目指します。
  `,
  firstAIComment:`＃あなたの反省に対して
即答できなかった質問については、しっかりとした準備が必要ですね。その一方で、全てを完璧に覚えるのは不可能です。知識のギャップを認め、後で正確な情報を提供するという姿勢も信頼関係構築につながります。競合他社の製品については、彼らの強みだけでなく、弱点についても理解し、そこをどのように弊社の製品が補うかをクライアントに示せるようになることが重要です。
  
＃あなたにない視点
商談での「良かったこと」にフォーカスすることは重要ですが、クライアントが何に最も関心を持っていたのか、どのポイントで最も熱心に質問していたのかを再検討すると良いでしょう。これは、彼らの本当の痛点や隠れたニーズを理解する手がかりになります。また、顧客が他社製品に対してどのような認識を持っているかも理解することで、対策を講じる際に有益な情報となります。
  
＃考えるべきポイント
製品のデモが良いフィードバックを得られたとのことですが、デモのどの部分がクライアントの注意を引いたのかを分析することが次回の商談に役立ちます。また、自分の製品知識の不足を感じた部分は具体的に何か、それを補うためにどの資料を読むべきか、誰に相談すべきかをリストアップしましょう。さらに、次回は質問に即答できなかった点も改善するため、類似の質問への対応策を用意しておくと安心です。
  `,
};
